#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_compute_global_address.grafana-k8-ip will be destroyed
  - resource "google_compute_global_address" "grafana-k8-ip" {
      - address            = "34.102.153.153" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2020-02-27T12:04:07.583-08:00" -> null
      - id                 = "projects/broad-jade-integration/global/addresses/grafana-k8-100" -> null
      - name               = "grafana-k8-100" -> null
      - prefix_length      = 0 -> null
      - project            = "broad-jade-integration" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/global/addresses/grafana-k8-100" -> null
    }

  # google_compute_global_address.jade-k8-ip will be destroyed
  - resource "google_compute_global_address" "jade-k8-ip" {
      - address            = "35.190.65.75" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2019-04-10T09:19:58.109-07:00" -> null
      - id                 = "jade-k8-100" -> null
      - name               = "jade-k8-100" -> null
      - prefix_length      = 0 -> null
      - project            = "broad-jade-integration" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/global/addresses/jade-k8-100" -> null

      - timeouts {}
    }

  # google_compute_global_address.jade-k8-ip["argocd"] will be created
  + resource "google_compute_global_address" "jade-k8-ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "argocd-k8-100"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_global_address.jade-k8-ip["grafana"] will be created
  + resource "google_compute_global_address" "jade-k8-ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "grafana-k8-100"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_global_address.jade-k8-ip["jade"] will be created
  + resource "google_compute_global_address" "jade-k8-ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "jade-k8-100"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_sql_database_instance.jade_100_postgres[0] will be updated in-place
  ~ resource "google_sql_database_instance" "jade_100_postgres" {
        connection_name               = "broad-jade-integration:us-central1:jade-postgres-101-d0e234edfe378f09"
        database_version              = "POSTGRES_9_6"
        first_ip_address              = "10.50.0.5"
        id                            = "jade-postgres-101-d0e234edfe378f09"
        ip_address                    = [
            {
                ip_address     = "10.50.0.5"
                time_to_retire = ""
                type           = "PRIVATE"
            },
        ]
        name                          = "jade-postgres-101-d0e234edfe378f09"
        private_ip_address            = "10.50.0.5"
        project                       = "broad-jade-integration"
        region                        = "us-central1"
        self_link                     = "https://www.googleapis.com/sql/v1beta4/projects/broad-jade-integration/instances/jade-postgres-101-d0e234edfe378f09"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ5ZmVi
                    MzE5OC0wNWE2LTRiNzQtYjE3MC04MzE4ZDkwODZiN2YxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMTkwNzE1MTgyODU3WhcNMjkwNzEyMTgyOTU3WjB3MS0wKwYD
                    VQQuEyQ5ZmViMzE5OC0wNWE2LTRiNzQtYjE3MC04MzE4ZDkwODZiN2YxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCXAxXoAz8otXdfAI/+kTI8qXOgGpBt1qAZiSUFsNTMZfxm7l0xC4Y/J3zjgta1
                    2deoZ2PCvgXCvVBiVJgetIQ/ZOHwmaXlI6bYBy9BZxCX+h2bE6Fut8y0rrDrCnrc
                    7GUcsgcN3MB1wdLpIqsdEKe8xBo/4YlvA1ZmpkkWwK9XcpyU4Kclwr+zVgnjvARI
                    aep1l0edoYed0O+H1iitSl0KehEhjbIkL89Cvg4LlBg0sprRwrEpGCvgN/A2hQEH
                    Da8BsIb1OxOkbWfimfCpB3mIcERh3LiGGgTY/ZtqIfeTwrxvt5GwenPETNZFo2v9
                    pDb9SdwY+PR5kfq9YDX1ledrAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAARZai8RnK3SEvFayspQkMCMp6wIqSc4rSEvzQvs
                    OJ+kc42Q5uByb4/zTMXFSxoL51ogcYLMw/3YytU3jynlq2uqCHBi1sttfggYz2+m
                    FiKS4M1ZfyTMh95T/45w4a8dEj2aGT+8L5VbjSw84cmOX3CqnJ2LNX8XzRWkyShT
                    wfLxraoyUJ6PqKOCKokd7iqQm3aZ1rpo7+TcmRHujAL64NkqJbKbz+KL1j0e2/Vi
                    Yf3iH8swQigWHGJbK4tikfHXS/fG4o0f9B/GmQ++CO4sY60zo8D4Lufn4uDDMdV8
                    XJK08/SODzY1jE2XL1mWLnyG/DSJYKOPsGv9xluIGkvtE38=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=9feb3198-05a6-4b74-b170-8318d9086b7f"
                create_time      = "2019-07-15T18:28:57.908Z"
                expiration_time  = "2029-07-12T18:29:57.908Z"
                sha1_fingerprint = "b98a8982a6296405cd578130bcb78a2456135c41"
            },
        ]
        service_account_email_address = "p257664558861-e1f8vt@gcp-sa-cloud-sql.iam.gserviceaccount.com"

      ~ settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
            replication_type            = "SYNCHRONOUS"
            tier                        = "db-g1-small"
            user_labels                 = {
                "app"   = "jade"
                "role"  = "database"
                "state" = "active"
            }
            version                     = 27

            backup_configuration {
                binary_log_enabled = false
                enabled            = true
                start_time         = "06:00"
            }

            database_flags {
                name  = "max_connections"
                value = "1024"
            }

          ~ ip_configuration {
                ipv4_enabled    = false
                private_network = "projects/broad-jade-integration/global/networks/integration-network"
                require_ssl     = true

              - authorized_networks {
                  - name  = "Broad" -> null
                  - value = "69.173.64.0/18" -> null
                }
              - authorized_networks {
                  - name  = "kubernetes" -> null
                  - value = "35.190.65.75" -> null
                }
              + authorized_networks {
                  + name  = "kubernetes"
                  + value = (known after apply)
                }
              + authorized_networks {
                  + name  = "Broad"
                  + value = "69.173.64.0/18"
                }
            }

            location_preference {
                zone = "us-central1-a"
            }
        }

        timeouts {}
    }

  # google_sql_database_instance.jade_11_postgres_db[0] will be updated in-place
  ~ resource "google_sql_database_instance" "jade_11_postgres_db" {
        connection_name               = "broad-jade-integration:us-central1:jade-postgres-11-3689a35c4c"
        database_version              = "POSTGRES_11"
        first_ip_address              = "10.50.0.11"
        id                            = "jade-postgres-11-3689a35c4c"
        ip_address                    = [
            {
                ip_address     = "10.50.0.11"
                time_to_retire = ""
                type           = "PRIVATE"
            },
        ]
        name                          = "jade-postgres-11-3689a35c4c"
        private_ip_address            = "10.50.0.11"
        project                       = "broad-jade-integration"
        region                        = "us-central1"
        self_link                     = "https://www.googleapis.com/sql/v1beta4/projects/broad-jade-integration/instances/jade-postgres-11-3689a35c4c"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQzZmZk
                    NzY2My0wZDk2LTQ2NzQtOGMzNS00MDc1MWQ4NmM5NGMxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjAwNDE0MjAwNDMwWhcNMzAwNDEyMjAwNTMwWjB3MS0wKwYD
                    VQQuEyQzZmZkNzY2My0wZDk2LTQ2NzQtOGMzNS00MDc1MWQ4NmM5NGMxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCy+uAfsJFQzgxVIh5GsSqc3ZfRRY9U6LZCQNCJ7I47m0qMR0BbV5yMs0TBgn4f
                    2FKLkxEOMHmDoz9NwZQkMwlvghfqMMzR+hzmfvMIFPj58Ws3OoLh/JnyE34/dzC1
                    ZROKLWSApxt56PfiaOr9Qh/E6szJasRaF+luJxMMjqDssKy7JmAAWhFYxiGFMvQn
                    6miyvSREjIjhSEWrncVxKr8A4y3ITsrqh9pe8AC3PRjxAi5aZY0Ff2xeiGfP4nn/
                    ZSmFcnSl+jpGAln4rmiytTECIAjjtS+Ub10XFdE3NogNMLX3CQZMUqzwNue0HXJd
                    +eYrYUo2ohgGeQz3UpplLViBAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAAKp1VekQGG/Pg+VKhaQwNlKG7sR6plOYyaAsxCN
                    0e9j3FE/4ZvncOzP6T8vnBSBMkRGkK3Lrm9Yfaeo8rIaBve6VzRt8BjemaS3CAmU
                    jr5KyHz0ESX15JV4SGzV4hzguf/DXcuP/tLljHIl45sDlNeK3DO0PSd4Tb8Bl5ig
                    dT9P2uMmC9Hgyx7anV1CeEpU7Z4QALVxm6X0iv1yD2dZKQWNQULYVlMGisUzqy0T
                    pOyFYBiftH/MGJzK+e8jU+ZTJMym+ELqGKPzOSlqE5rIh/9XoBwLHCWWmTu2Zayb
                    xouPyMivUIvXXjixFEb/4fyESzqbBHQuewirvSoZqxN6QhQ=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=3ffd7663-0d96-4674-8c35-40751d86c94c"
                create_time      = "2020-04-14T20:04:30.932Z"
                expiration_time  = "2030-04-12T20:05:30.932Z"
                sha1_fingerprint = "07df35b18d6b87cd4b9872da9d8301d59c3db354"
            },
        ]
        service_account_email_address = "p257664558861-q9k8pw@gcp-sa-cloud-sql.iam.gserviceaccount.com"

      ~ settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
            replication_type            = "SYNCHRONOUS"
            tier                        = "db-g1-small"
            user_labels                 = {
                "app"   = "jade"
                "role"  = "database"
                "state" = "active"
            }
            version                     = 1

            backup_configuration {
                binary_log_enabled = false
                enabled            = true
                start_time         = "06:00"
            }

            database_flags {
                name  = "max_connections"
                value = "1024"
            }

          ~ ip_configuration {
                ipv4_enabled    = false
                private_network = "projects/broad-jade-integration/global/networks/integration-network"
                require_ssl     = true

              - authorized_networks {
                  - name  = "Broad" -> null
                  - value = "69.173.64.0/18" -> null
                }
              - authorized_networks {
                  - name  = "kubernetes" -> null
                  - value = "35.190.65.75" -> null
                }
              + authorized_networks {
                  + name  = "kubernetes"
                  + value = (known after apply)
                }
              + authorized_networks {
                  + name  = "Broad"
                  + value = "69.173.64.0/18"
                }
            }

            location_preference {
                zone = "us-central1-f"
            }
        }
    }

  # module.dns-set.google_dns_record_set.set_dns_record["argocd"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-integration"
      + name         = "argocd.datarepo-integration.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = [
          + "argocd-global-integration.datarepo-integration.broadinstitute.org.",
        ]
      + ttl          = 300
      + type         = "CNAME"
    }

  # module.dns-set.google_dns_record_set.set_dns_record["argocd-global-integration"] will be created
  + resource "google_dns_record_set" "set_dns_record" {
      + id           = (known after apply)
      + managed_zone = "datarepo-integration"
      + name         = "argocd-global-integration.datarepo-integration.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # module.dns-set.google_dns_record_set.set_dns_record["grafana-global-integration"] will be updated in-place
  ~ resource "google_dns_record_set" "set_dns_record" {
        id           = "datarepo-integration/grafana-global-integration.datarepo-integration.broadinstitute.org./A"
        managed_zone = "datarepo-integration"
        name         = "grafana-global-integration.datarepo-integration.broadinstitute.org."
        project      = "broad-jade-integration"
      ~ rrdatas      = [
          - "34.102.153.153",
        ] -> (known after apply)
        ttl          = 300
        type         = "A"
    }

  # module.dns-set.google_dns_record_set.set_dns_record["jade-global-integration"] will be updated in-place
  ~ resource "google_dns_record_set" "set_dns_record" {
        id           = "datarepo-integration/jade-global-integration.datarepo-integration.broadinstitute.org./A"
        managed_zone = "datarepo-integration"
        name         = "jade-global-integration.datarepo-integration.broadinstitute.org."
        project      = "broad-jade-integration"
      ~ rrdatas      = [
          - "35.190.65.75",
        ] -> (known after apply)
        ttl          = 300
        type         = "A"
    }

Plan: 5 to add, 4 to change, 2 to destroy.

Warning: Interpolation-only expressions are deprecated

  on integration.tf line 79, in resource "google_dns_managed_zone" "dns_zone":
  79:   count       = "${var.env == var.suffix ? "1" : "0"}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


Warning: Quoted references are deprecated

  on .terraform/modules/dns-set/terraform-modules/external-dns/dns.tf line 6, in data "google_dns_managed_zone" "dns_zone":
   6:     provider     = "google.targetdns"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)

```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
